# Задание-1:
# Напишите функцию, возвращающую ряд Фибоначчи с n-элемента до m-элемента.
# Первыми элементами ряда считать цифры 1 1

#1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711,

def fibonacci(n, m):
    lst = [1, 1]
    for i in range(2, m+1):
        lst.append(lst[i-2]+lst[i-1])
    return lst[n:m]

print(fibonacci(5, 20))