# Задание-2: Дата задана в виде строки формата 'dd.mm.yyyy'.
# Проверить, корректно ли введена дата.
# Условия корректности:
# 1. День должен приводиться к целому числу в диапазоне от 1 до 30(31)
#  (в зависимости от месяца, февраль не учитываем)
# 2. Месяц должен приводиться к целому числу в диапазоне от 1 до 12
# 3. Год должен приводиться к целому положительному числу в диапазоне от 1 до 9999
# 4. Длина исходной строки для частей должна быть в соответствии с форматом
#  (т.е. 2 символа для дня, 2 - для месяца, 4 - для года)

dt = input('Введите дату: ')

day, month, year = dt.split('.')
if len(day) == len(month) == 2 and len(year) == 4:
    day, month, year = [int(i) for i in [day, month, year]]
    if 1 <= year <= 9999:
        if 1 <= month <= 12:
            if (month in [1,3,5,7,8,10,12] and 1<= day <=31) or 1<= day <= 30:
                print('Корректная дата')
            else:
                print('Некорректная дата')
        else:
            print('Некорректная дата')
    else:
        print('Некорректная дата')
else:
    print('Некорректная дата')