# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

fruits = ['апельсин', 'яблоко', 'груша', 'манго']
for i, fruit in enumerate(fruits):
    print(f'{i+1}. - {fruit:>10}')